In [1]:
#import dependancies

import pandas as pd
import numpy as np
from sqlalchemy_utils import database_exists, create_database
from sqlalchemy import create_engine
pd.set_option('max_colwidth', 400)

In [2]:
#read in csv
datascience_df = pd.read_csv("Resources/v5_Latest_Data_Science_Salaries.csv")
datascience_df.head()

,Job Title,Employment Type,Experience Level,Expertise Level,Salary,Salary Currency,Company Location,Salary in USD,Employee Residence,Company Size,Year
0,Staff Data Analyst,Contract,Entry,Junior,60000,Canadian Dollar,Canada,44753,Canada,Large,2020
1,AI Engineer,Full-Time,Entry,Junior,35000,United States Dollar,Germany,35000,Croatia,Medium,2023
2,AI Developer,Full-Time,Senior,Expert,50000,Euro,Italy,53984,Italy,Small,2023
3,Machine Learning Engineer,Full-Time,Senior,Expert,226600,United States Dollar,United States,226600,United States,Medium,2023
4,Machine Learning Engineer,Full-Time,Senior,Expert,140100,United States Dollar,United States,140100,United States,Medium,2023

In [3]:
#dropping columns
columns_to_drop = ['Experience Level', 'Salary', 'Salary Currency', 'Employee Residence']
datascience_df = datascience_df.drop(columns=columns_to_drop)

datascience_df.head()

,Job Title,Employment Type,Expertise Level,Company Location,Salary in USD,Company Size,Year
0,Staff Data Analyst,Contract,Junior,Canada,44753,Large,2020
1,AI Engineer,Full-Time,Junior,Germany,35000,Medium,2023
2,AI Developer,Full-Time,Expert,Italy,53984,Small,2023
3,Machine Learning Engineer,Full-Time,Expert,United States,226600,Medium,2023
4,Machine Learning Engineer,Full-Time,Expert,United States,140100,Medium,2023

In [4]:
#count of jobs by expertise level
jobs_by_expertise = datascience_df.groupby("Expertise Level")["Job Title"].value_counts()
jobs_by_expertise

Expertise Level  Job Title
Director         Data Engineer               60
                 Director of Data Science    20
                 Data Scientist              19
                 Head of Data                15
                 Head of Data Science        10
                                             ..
Junior           Data Specialist              1
                 Finance Data Analyst         1
                 Financial Data Analyst       1
                 Marketing Data Engineer      1
                 Staff Data Analyst           1
Name: Job Title, Length: 247, dtype: int64

In [5]:
#count of employment types
datascience_df["Employment Type"].value_counts()

Full-Time    3909
Contract       18
Part-Time      13
Freelance      11
Name: Employment Type, dtype: int64

In [6]:
#max salaries by job title
max_salaries = datascience_df.groupby('Job Title')['Salary in USD'].max()
max_salaries.sort_values(ascending=False)

Job Title
Research Scientist                    450000
Data Analyst                          430967
Analytics Engineer                    430640
Applied Machine Learning Scientist    423000
AI Scientist                          417937
                                       ...
Data DevOps Engineer                   53984
Insight Analyst                        51676
Data Engineer 2                        46565
Principal Data Architect               38154
Data Quality Engineer                  23753
Name: Salary in USD, Length: 120, dtype: int64

In [7]:
#min salaries by job titles
min_salaries = datascience_df.groupby('Job Title')['Salary in USD'].min()
min_salaries.sort_values(ascending=True)

Job Title
Data Analyst                        15000
Business Intelligence Developer     15000
Machine Learning Developer          15000
Staff Data Analyst                  15000
Computer Vision Engineer            15897
                                    ...
Cloud Data Architect               250000
AWS Data Architect                 258000
Managing Director Data Science     300000
Data Science Tech Lead             375000
Analytics Engineering Manager      399880
Name: Salary in USD, Length: 120, dtype: int64

In [8]:
#average salary by expertise level
average_salary_by_expertise = datascience_df.groupby('Expertise Level')['Salary in USD'].mean().round(2)
average_salary_by_expertise

Expertise Level
Director        189102.59
Expert          160260.30
Intermediate    109965.20
Junior           80842.24
Name: Salary in USD, dtype: float64

In [9]:
#average salary by country
average_salary_by_country = datascience_df.groupby('Company Location')['Salary in USD'].mean().round(2)
average_salary_by_country.sort_values(ascending=False)

Company Location
Qatar                   300000.00
Israel                  217332.00
Puerto Rico             167500.00
United States           158183.82
Canada                  135117.88
                          ...
Egypt                    22800.00
Turkey                   22313.60
Honduras                 20000.00
Moldova, Republic of     18000.00
Ecuador                  16000.00
Name: Salary in USD, Length: 72, dtype: float64

In [10]:
#number of jobs per country
jobs_by_country = datascience_df.groupby('Company Location')['Job Title'].count()
jobs_by_country.sort_values(ascending=False)

Company Location
United States     3011
United Kingdom     293
Canada             145
Germany             70
Spain               55
                  ...
Armenia              1
Chile                1
Malaysia             1
Malta                1
Algeria              1
Name: Job Title, Length: 72, dtype: int64

In [11]:
#creating new csv
datascience_df.to_csv("Resources/salaries.csv", index=False)

salaries= pd.read_csv("Resources/salaries.csv")
salaries.head()

,Job Title,Employment Type,Expertise Level,Company Location,Salary in USD,Company Size,Year
0,Staff Data Analyst,Contract,Junior,Canada,44753,Large,2020
1,AI Engineer,Full-Time,Junior,Germany,35000,Medium,2023
2,AI Developer,Full-Time,Expert,Italy,53984,Small,2023
3,Machine Learning Engineer,Full-Time,Expert,United States,226600,Medium,2023
4,Machine Learning Engineer,Full-Time,Expert,United States,140100,Medium,2023

In [12]:
# Connecting to sql database
engine = create_engine('postgresql://postgres:postgres@localhost/datascience')

# Creating database
if not database_exists(engine.url):
    create_database(engine.url)
if database_exists(engine.url):
    print('Database was created successfully!')
else:
    print('Something went wrong.')

Database was created successfully!

In [13]:
# Exporting data to sql database
salaries.to_sql('salaries', engine, if_exists='replace', index=False)

951